# Data Engineering Syntax Assessment (Hyunjun Lee)

## Question 1

In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame({'name': ['Andy', 'Jose', 'Dieu', 'Chloe', 'Jose'],
                   'continent': ['America', 'Europe', 'Asia', 'America', 'Europe'],
                   'college': ['Lib Arts', 'Business', 'Engineering', 'Engineering', 'Business']})
df

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

**A) Write code to de-dup STUDENTS**

In [8]:
df = df.drop_duplicates()
df

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

**B) Create a dataframe COUNTS storing the count of students for each continent, college pair**

In [15]:
counts = df.pivot_table(index=['continent', 'college'], values='name', aggfunc=['count'])

In [16]:
counts

                      count
                       name
continent college
America   Engineering     1
          Lib Arts        1
Asia      Engineering     1
Europe    Business        1

**C) Pivot COUNTS so that continent values become column names**

In [20]:
counts.pivot_table(index='college', columns='continent', values='count')

               name
continent   America Asia Europe
college
Business        NaN  NaN    1.0
Engineering     1.0  1.0    NaN
Lib Arts        1.0  NaN    NaN

**D) If applicable, remove any unnecessary index levels created in part C**

- No unnecessary indices for pivoted data table

**E) Zero-fill missing values in COUNTS**

In [22]:
counts.pivot_table(index='college', columns='continent', values='count').fillna(0)

               name
continent   America Asia Europe
college
Business        0.0  0.0    1.0
Engineering     1.0  1.0    0.0
Lib Arts        1.0  0.0    0.0

**F) Sort COUNTS reverse alphabetically by college name**

In [23]:
counts.pivot_table(index='college', columns='continent', values='count').fillna(0).sort_values(by='college',ascending=False)

               name
continent   America Asia Europe
college
Lib Arts        1.0  0.0    0.0
Engineering     1.0  1.0    0.0
Business        0.0  0.0    1.0

## Question 2 (Python syntax)

**A) Select the answer to complete the assigned task**

- Answer: A) `(df.loc[['apr', 'may', 'jun']]['eggs']>100).sum()`

**B) Complete the script to produce the output shown**

- Answer: A) `strptime`, `.date()`

**C) Select the correct scropt to accomplish the task**

- Answer: B) `iris.loc[(iris['Species']=='setosa') & (iris['Petal.Width']>2)].sort_values('Sepal.Length', ascending=False)`